cf/Catalogs/GlobalPartners.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>GlobalPartners</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>GlobalID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LocalEntity</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Entity</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GlobalEntity</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Type>
						<v8:Type>cfg:EnumRef.GlobalPartnersTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DetailedType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PartnersDetailedTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExistingLocalID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsSupplier</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsCustomer</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsNonTrade</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsInstitution</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Market</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Incoterms</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Incoterms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeliveryAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PartnersStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/GlobalPartners/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

////////////////////////////////////////////////////////
// Выделение изменений

Функция СписокРеквизитовВыделенияИзменений() Экспорт
	Возврат Неопределено	
КонецФункции	

Функция СписокРеквизитовИсключенийВыделенияИзменений() Экспорт
	Возврат "Код"
КонецФункции	

Функция НастройкиОформленияВыделенияИзмененийТабличныхЧастей() Экспорт
	
	Настройки_ДополнительнаяКлассификация = Новый Структура;
	Настройки_ДополнительнаяКлассификация.Вставить("КлючСтроки", "ВидКлассификатора,Класс");
	Настройки_ДополнительнаяКлассификация.Вставить("Реквизиты" , "");
	Настройки_ДополнительнаяКлассификация.Вставить("Элемент"   , "ДополнительнаяКлассификация");
	
	НастройкиОформления = Новый Структура;
	НастройкиОформления.Вставить("ДополнительнаяКлассификация"   , Настройки_ДополнительнаяКлассификация);
	
	Возврат НастройкиОформления
	
КонецФункции

#КонецОбласти

//interface Global
Функция GetDataSet(Ссылка) Экспорт 
	
	СсылкаСтруктура = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "LocalEntity,Entity,Type,DetailedType,Наименование,ExistingLocalID,IsSupplier,IsCustomer,IsNonTrade,IsInstitution,Market,Incoterms,DeliveryAddress,Currency");
	
	DataSet = Новый Структура;
	DataSet.Вставить("GUID", Строка(Ссылка.УникальныйИдентификатор()));
	DataSet.Вставить("LocalID", СокрЛП(СсылкаСтруктура.LocalEntity.Код));
	DataSet.Вставить("Entity", СокрЛП(СсылкаСтруктура.Entity.Код));
	DataSet.Вставить("Type", Строка(СсылкаСтруктура.Type));
	DataSet.Вставить("DetailedType", Строка(СсылкаСтруктура.DetailedType));
	DataSet.Вставить("FullName", СсылкаСтруктура.Наименование);
	DataSet.Вставить("ExistingLocalID", СсылкаСтруктура.ExistingLocalID);                                                     
	DataSet.Вставить("IsSupplier", Формат(СсылкаСтруктура.IsSupplier, "БЛ='0'; БИ='1'"));
	DataSet.Вставить("IsCustomer", Формат(СсылкаСтруктура.IsCustomer, "БЛ='0'; БИ='1'"));
	DataSet.Вставить("IsNonTrade", Формат(СсылкаСтруктура.IsNonTrade, "БЛ='0'; БИ='1'"));
	DataSet.Вставить("IsInstitution", Формат(СсылкаСтруктура.IsInstitution, "БЛ='0'; БИ='1'"));
	DataSet.Вставить("Market", СсылкаСтруктура.Market.КодАльфа2);
	DataSet.Вставить("Incoterms", СсылкаСтруктура.Incoterms.Код);
	DataSet.Вставить("DeliveryAddress", СсылкаСтруктура.DeliveryAddress);
	DataSet.Вставить("Currency", СокрЛП(СсылкаСтруктура.Currency));
	
	Возврат DataSet;

КонецФункции // GetDataSet()

Функция АтрибутыGlobal() Экспорт 

	АтрибутыGlobal = Новый Структура;
	
	Возврат АтрибутыGlobal;
	
КонецФункции // РеквизитыДляЗапросаНового()

Функция ИдентификаторыGlobal() Экспорт 

	ИдентификаторыGlobal = Новый Структура;
	ИдентификаторыGlobal.Вставить("GlobalID", "GlobalID");
	
	Возврат ИдентификаторыGlobal;
	
КонецФункции // РеквизитыДляЗапросаНового()

Функция ВыполнитьПроверкуОтвета(ОтветСтрока) Экспорт 

	Результат = Новый Структура;
	
	Результат.Вставить("result", Истина);
	//Если СтрДлина(СокрЛП(ОтветСтрока.GlobalID)) = 18 Тогда
	//	Результат.Вставить("result", Истина);
	//Иначе
	//	ОписаниеОшибки = "Длина Global ID не соответствует шаблону.";
	//	Результат.Вставить("error", ОписаниеОшибки);
	//КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции // ВыполнитьПроверкуОтвета()
